modules/User/Admin/RoleController.php

insert into `core_roles` (`name`, `guard_name`, `updated_at`, `created_at`) values ('Vendor', 'web', '2019-07-10 09:12:58', '2019-07-10 09:12:58')
---
    public function create(Request $request)
    {
        if (!empty($request->input())) {
            $row = new Role($request->input());
            if ($row->save()) {