modules/Tour/Admin/TourController.php

    public function index(Request $request)
    {
        $this->checkPermission('tour_view');
        $query = Tour::query() ;
        $query->orderBy('id', 'desc');
        if (!empty($tour_name = $request->input('s'))) {
            $query->where('title', 'LIKE', '%' . $tour_name . '%');
            $query->orderBy('title', 'asc');
        }
        if (!empty($cate = $request->input('cate_id'))) {
            $query->where('category_id', $cate);
        }
        if ($this->hasPermission('tour_manage_others')) {
            if (!empty($author = $request->input('vendor_id'))) {
                $query->where('create_user', $author);
            }
        } else {
            $query->where('create_user', Auth::id());
        }
        $data = [
            'rows'               => $query->with(['getAuthor','category_tour'])->paginate(20),
            'tour_categories'    => TourCategory::where('status', 'publish')->get()->toTree(),
            'tour_manage_others' => $this->hasPermission('tour_manage_others'),
            'breadcrumbs'        => [
                [
                    'name' => __('Tours'),
                    'url'  => 'admin/module/tour'
                ],
                [
                    'name'  => __('All'),
                    'class' => 'active'
                ],
            ]
        ];
---
select * from `bravo_tour_category` where `bravo_tour_category`.`id` in (1, 2, 3, 4) and `bravo_tour_category`.`deleted_at` is null
select * from `users` where `users`.`id` in (1) and `users`.`deleted_at` is null
select * from `bravo_tour_category` where `status` = 'publish' and `bravo_tour_category`.`deleted_at` is null