modules/Booking/Models/Booking.php

    public static function getTopCardsReport()
    {

        $res = [];
        $total_money = parent::where('status', '!=', 'draft')->sum('total');
        $total_booking = parent::where('status', '!=', 'draft')->count('id');
        $total_user = \App\User::where('status', '!=', 'blocked')->count('id');
---
select count(`id`) as aggregate from `users` where `status` != 'blocked' and `users`.`deleted_at` is null